In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import pickle

In [12]:
qs = ['biography', 'detective', 'fiction', 'mystery', 'non fiction', 'novel', 'Book', 'action', 'bollywood', 'comedy', 'detective', 'drama', 'hollywood', 'horror', 'romantic', 'scifi', 'thriller', 'Movie', 'country music', 'edm', 'heavy metal', 'hip hop', 'jazz', 'pop', 'rock', 'Music', 'baseball', 'basketball', 'chess', 'cricket', 'football', 'hockey', 'Sport', 'Cluster #']

In [11]:
for i in new_profile.columns[0:]:
    new_profile[i] = np.random.randint(0,10,1)

NameError: name 'new_profile' is not defined

In [14]:
df = pd.DataFrame(np.random.randint(0,1,size=(1,34)), columns=qs)

In [15]:
df

,biography,detective,fiction,mystery,non fiction,novel,Book,action,bollywood,comedy,...,rock,Music,baseball,basketball,chess,cricket,football,hockey,Sport,Cluster #
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [16]:
df.head()

,biography,detective,fiction,mystery,non fiction,novel,Book,action,bollywood,comedy,...,rock,Music,baseball,basketball,chess,cricket,football,hockey,Sport,Cluster #
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [17]:
with open("profiles_clustered.pkl","wb") as fp:
    pickle.dump(df,fp)

In [9]:
with open("profiles.pkl",'rb') as fp:
    raw_df = pickle.load(fp)

In [10]:
raw_df

,biography,detective,fiction,mystery,non fiction,novel,Book,action,bollywood,comedy,...,pop,rock,Music,baseball,basketball,chess,cricket,football,hockey,Sport
0,9,7,2,5,0,8,8,7,8,5,...,3,4,2,1,3,6,1,7,2,9